01  WS-DATA-AREA. 
    05  WS-AMOUNT         PIC 9(5)V99 VALUE 0. 
    05  WS-FLAG           PIC X VALUE 'N'.

PROCEDURE DIVISION.

    ADD 100 TO WS-AMOUNT. 
    IF WS-AMOUNT > 99999.99 THEN 
        MOVE 'Y' TO WS-FLAG
    END-IF.
    DISPLAY WS-AMOUNT.
    DISPLAY WS-FLAG.
    STOP RUN.