01  WS-DATA-AREA. 
    05  WS-AMOUNT         PIC 9(7)V99 VALUE 0. 
    05  WS-FLAG           PIC X VALUE 'N'.
    05 WS-OVERFLOW-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.

    ADD 100 TO WS-AMOUNT.
    IF WS-AMOUNT > 999999.99 THEN
        MOVE 'Y' TO WS-OVERFLOW-FLAG
        DISPLAY "Arithmetic Overflow Occurred!"
    END-IF.
    IF WS-AMOUNT > 99999.99 THEN 
        MOVE 'Y' TO WS-FLAG
    END-IF.
    DISPLAY WS-AMOUNT.
    DISPLAY WS-FLAG.
    DISPLAY WS-OVERFLOW-FLAG.
    STOP RUN.